import os


class System:
    #--путь к корню приложения--
    APP_PATH = "/".join(os.path.abspath('main.py').split('\\')[:-1])
    #------------------------

class ScreenSize:
    #--Стандартные размеры окон--

    #--720p--
    HEIGHT_720 = 720
    WIDTH_1280 = 1280
    #--------

    #--1080p--
    HEIGHT_1080 = 1080
    WIDTH_1920 = 1920
    #---------

    #--1440p--
    HEIGHT_1440 = 1440
    WIDTH_2560 = 2560
    #---------

    #----------------------------


class ButtonType:
    #--Основные кнопки главного меню--

    DEFAULT_BUTTON = 0 # стандартная кнопка
    START_NEW_GAME = 1 # кнопка старта новой игры
    LOAD_GAME = 2 # кнопка загрузки сохранений
    OPTIONS = 3 # кнопка настроек
    QUIT = 4 # кнопка выхода из игры

    # ---------------------------------